load/loadTestResults/be-load-test-results.log
vamsidarbhamulla@Vamsis-MacBook-Pro backend % k6 run loadTest.js

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: loadTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 4m30s max duration (incl. graceful stop):
           * default: Up to 100 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (4m00.9s), 000/100 VUs, 4909 complete and 0 interrupted iterations
default ✓ [======================================] 000/100 VUs  4m0s

     █ page_1 - https://blazedemo.com/

     █ page_2 - https://blazedemo.com/reserve.php

     █ page_3 - https://blazedemo.com/purchase.php

     data_received..................: 3.0 GB 13 MB/s
     data_sent......................: 19 MB  79 kB/s
     group_duration.................: avg=899.66ms min=338.81ms med=797.52ms max=4.26s    p(90)=1.45s    p(95)=1.72s
     http_req_blocked...............: avg=84.33µs  min=0s       med=0s       max=226.25ms p(90)=1µs      p(95)=1µs
     http_req_connecting............: avg=30.68µs  min=0s       med=0s       max=46.26ms  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=149.75ms min=37.58ms  med=89.42ms  max=3.73s    p(90)=277ms    p(95)=399.18ms
       { expected_response:true }...: avg=149.75ms min=37.58ms  med=89.42ms  max=3.73s    p(90)=277ms    p(95)=399.18ms
     http_req_failed................: 0.00%  ✓ 0          ✗ 88362
     http_req_receiving.............: avg=18.33ms  min=16µs     med=2.17ms   max=1.39s    p(90)=59.74ms  p(95)=105.5ms
     http_req_sending...............: avg=63.35µs  min=15µs     med=51µs     max=8.05ms   p(90)=108µs    p(95)=132µs
     http_req_tls_handshaking.......: avg=52.42µs  min=0s       med=0s       max=194.85ms p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=131.36ms min=37.21ms  med=78.85ms  max=3.73s    p(90)=232.02ms p(95)=349.82ms
     http_reqs......................: 88362  366.818379/s
     iteration_duration.............: avg=3.69s    min=2.06s    med=3.66s    max=8.42s    p(90)=4.82s    p(95)=5.27s
     iterations.....................: 4909   20.378799/s
     vus............................: 2      min=2        max=100
     vus_max........................: 100    min=100      max=100

vamsidarbhamulla@Vamsis-MacBook-Pro backend % k6 run loadTest.js

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: loadTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 55s max duration (incl. graceful stop):
           * default: Up to 1000 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (46.4s), 0000/1000 VUs, 1016 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  25s

     █ page_1 - https://blazedemo.com/

     █ page_2 - https://blazedemo.com/reserve.php

     █ page_3 - https://blazedemo.com/purchase.php

     data_received..................: 627 MB 14 MB/s
     data_sent......................: 5.4 MB 117 kB/s
     group_duration.................: avg=9.62s    min=380.8ms med=8.25s    max=38.45s   p(90)=18.96s p(95)=23.28s
     http_req_blocked...............: avg=4.52ms   min=0s      med=1µs      max=248.33ms p(90)=1µs    p(95)=63.9ms
     http_req_connecting............: avg=1.84ms   min=0s      med=0s       max=158.11ms p(90)=0s     p(95)=23.5ms
     http_req_duration..............: avg=1.59s    min=39.51ms med=868ms    max=27.57s   p(90)=3.99s  p(95)=5.56s
       { expected_response:true }...: avg=1.59s    min=39.51ms med=868ms    max=27.57s   p(90)=3.99s  p(95)=5.56s
     http_req_failed................: 0.01%  ✓ 2          ✗ 18286
     http_req_receiving.............: avg=839.8ms  min=26µs    med=36.8ms   max=26.61s   p(90)=2.52s  p(95)=4.26s
     http_req_sending...............: avg=68.79µs  min=18µs    med=49µs     max=5.02ms   p(90)=126µs  p(95)=187µs
     http_req_tls_handshaking.......: avg=2.66ms   min=0s      med=0s       max=194.58ms p(90)=0s     p(95)=38.24ms
     http_req_waiting...............: avg=759.66ms min=38.57ms med=316.19ms max=18.79s   p(90)=2.04s  p(95)=3.17s
     http_reqs......................: 18288  394.318238/s
     iteration_duration.............: avg=29.87s   min=13.08s  med=30.06s   max=44.97s   p(90)=36.91s p(95)=37.68s
     iterations.....................: 1016   21.906569/s
     vus............................: 3      min=3        max=1000
     vus_max........................: 1000   min=1000     max=1000