load/loadTestResults/fe-load-test-results-flight-destination.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: blazedemo-flight-destination-test.js
     output: -

  scenarios: (100.00%) 1 scenario, 10 max VUs, 55s max duration (incl. graceful stop):
           * default: Up to 10 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  01.0s/25.0s

running (02.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  02.0s/25.0s

running (03.0s), 03/10 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 03/10 VUs  03.0s/25.0s

running (04.0s), 04/10 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 04/10 VUs  04.0s/25.0s

running (05.0s), 05/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 05/10 VUs  05.0s/25.0s

running (06.0s), 06/10 VUs, 1 complete and 0 interrupted iterations
default   [  24% ] 06/10 VUs  06.0s/25.0s

running (07.0s), 07/10 VUs, 2 complete and 0 interrupted iterations
default   [  28% ] 07/10 VUs  07.0s/25.0s

running (08.0s), 08/10 VUs, 2 complete and 0 interrupted iterations
default   [  32% ] 08/10 VUs  08.0s/25.0s

running (09.0s), 09/10 VUs, 4 complete and 0 interrupted iterations
default   [  36% ] 09/10 VUs  09.0s/25.0s

running (10.0s), 09/10 VUs, 4 complete and 0 interrupted iterations
default   [  40% ] 09/10 VUs  10.0s/25.0s

running (11.0s), 10/10 VUs, 5 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  11.0s/25.0s

running (12.0s), 10/10 VUs, 5 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  12.0s/25.0s

running (13.0s), 10/10 VUs, 7 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  13.0s/25.0s

running (14.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  14.0s/25.0s

running (15.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  15.0s/25.0s

running (16.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  16.0s/25.0s

running (17.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  17.0s/25.0s

running (18.0s), 09/10 VUs, 12 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  18.0s/25.0s

running (19.0s), 08/10 VUs, 14 complete and 0 interrupted iterations
default   [  76% ] 08/10 VUs  19.0s/25.0s

running (20.0s), 08/10 VUs, 16 complete and 0 interrupted iterations
default   [  80% ] 08/10 VUs  20.0s/25.0s

running (21.0s), 07/10 VUs, 17 complete and 0 interrupted iterations
default   [  84% ] 07/10 VUs  21.0s/25.0s

running (22.0s), 07/10 VUs, 18 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  22.0s/25.0s

running (23.0s), 06/10 VUs, 20 complete and 0 interrupted iterations
default   [  92% ] 06/10 VUs  23.0s/25.0s

running (24.0s), 05/10 VUs, 21 complete and 0 interrupted iterations
default   [  96% ] 05/10 VUs  24.0s/25.0s

running (25.0s), 03/10 VUs, 23 complete and 0 interrupted iterations
default   [ 100% ] 03/10 VUs  25.0s/25.0s

running (26.0s), 03/10 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/10 VUs  25s

running (27.0s), 03/10 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/10 VUs  25s

running (28.0s), 03/10 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/10 VUs  25s

running (29.0s), 01/10 VUs, 25 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/10 VUs  25s

running (29.4s), 00/10 VUs, 26 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  25s

     browser_dom_content_loaded.......: avg=58.39ms  min=96µs    med=36.88ms  max=334.17ms  p(90)=144.93ms p(95)=156.99ms
     browser_first_contentful_paint...: avg=184.39ms min=26.02ms med=164.03ms max=570.52ms  p(90)=340.51ms p(95)=427.09ms
     browser_first_meaningful_paint...: avg=189.93ms min=30ms    med=170.13ms max=570.52ms  p(90)=300.58ms p(95)=352.93ms
     browser_first_paint..............: avg=184.27ms min=25.94ms med=163.92ms max=570.52ms  p(90)=340.51ms p(95)=427.09ms
     browser_loaded...................: avg=74.06ms  min=3.72ms  med=35.01ms  max=333.58ms  p(90)=184.25ms p(95)=224.82ms
     data_received....................: 11 MB  362 kB/s
     data_sent........................: 125 kB 4.3 kB/s
     http_req_connecting..............: avg=8.38ms   min=0s      med=0s       max=211ms     p(90)=23.4ms   p(95)=72ms    
     http_req_duration................: avg=9m20s    min=50.99µs med=53.75ms  max=25h36m21s p(90)=192.97ms p(95)=241.56ms
     http_req_receiving...............: avg=71.91ms  min=0s      med=55ms     max=208ms     p(90)=158ms    p(95)=169.09ms
     http_req_sending.................: avg=110.09µs min=0s      med=0s       max=2ms       p(90)=0s       p(95)=1ms     
     http_req_tls_handshaking.........: avg=4.62ms   min=0s      med=0s       max=187ms     p(90)=0s       p(95)=49ms    
     http_reqs........................: 329    11.207694/s
     iteration_duration...............: avg=7.19s    min=5.19s   med=7.26s    max=9.16s     p(90)=8.48s    p(95)=8.84s   
     iterations.......................: 26     0.885714/s
     vus..............................: 1      min=1       max=10
     vus_max..........................: 10     min=10      max=10